In [3]:
import mysql.connector
from pymysql import connect
from mysql.connector import Error
import pandas as pd

In [6]:
data1=connect(host='localhost',user='root',passwd='admin123')
cur=data1.cursor()
query='show databases'
cur.execute(query)
datas1=cur.fetchall()

for data in datas1:
    print(data)

('class',)
('demonstration',)
('information_schema',)
('joins',)
('k20ch',)
('market_star',)
('my_sql',)
('my_sql_',)
('mysql',)
('performance_schema',)
('program3',)
('programs',)
('subqueries',)
('sys',)

In [7]:
database=connect(host='localhost',user='root',passwd='admin123',database='my_sql_')
cur=database.cursor()
query='show tables'
cur.execute(query)
tables=cur.fetchall()

for table in tables:
    print(table)

('orders',)

In [8]:
query='select * from orders'
cur.execute(query)

4

In [10]:
df=pd.read_sql(query,database)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phonme_num
0,101,Steve,laptop,2018-06-12,2,800.0,6293730802
1,102,olive,books,2019-07-14,10,12.0,8367489124
2,103,Alan,Trouser,2017-06-11,12,452.0,986591056
3,104,karthik,books,2020-05-11,8,120.0,8958557608